УТ/src/DataProcessors/CRM_МастерРегистрацииОбращения/CRM_МастерРегистрацииОбращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_МастерРегистрацииОбращения</name>
</mdclass:DataProcessor>

УТ/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонСДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВсегда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьСвязанныеДиалоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЧекЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаВыполненияЧекЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/DataProcessors/CRM_МастерРегистрацииОбращения/Forms/ФормаНастроек/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойТипУслуг;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Пользователь = Пользователи.АвторизованныйПользователь();
	Менеджер.Прочитать();
	Попытка
		ОсновнойТипУслуг = Менеджер.Значение;
	Исключение
		ОсновнойТипУслуг = Ложь;
	КонецПопытки;
	
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойСценарий;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Пользователь = Пользователи.АвторизованныйПользователь();
	Менеджер.Прочитать();
	Попытка
		ОсновнойСценарий = Менеджер.Значение;
	Исключение
		ОсновнойСценарий = Ложь;
	КонецПопытки;
	
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойТипОбращения;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Пользователь = Пользователи.АвторизованныйПользователь();
	Менеджер.Прочитать();
	Попытка
		ОсновнойТипОбращения = Менеджер.Значение;
	Исключение
		ОсновнойТипОбращения = Справочники.CRM_ТипыОбращений.ПустаяСсылка();
	КонецПопытки;
	
	ПоискПоПочтовомуДомену = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.ПоискПоПочтовомуДомену",
		 "МастерРегистрации",
		 Ложь);
	
	РежимВводаНовогоКлиента = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.РежимВводаНовогоКлиента",
		 "МастерРегистрации",
		 1);
	
	Если РольДоступна("ПолныеПрава") Или РольДоступна("CRM_НастройкаПрограммы") Тогда
		Элементы.ГруппаОбщиеНастройки.Видимость = Истина;
		
		CRM_ОсновнойВидEmailКлиента = Константы.CRM_ОсновнойВидEmailКлиента.Получить();
		CRM_ОсновнойВидТелефонаКлиента = Константы.CRM_ОсновнойВидТелефонаКлиента.Получить();
		CRM_ОсновнойВидEmailКонтакта = Константы.CRM_ОсновнойВидEmailКонтакта.Получить();
		CRM_ОсновнойВидТелефонаКонтакта = Константы.CRM_ОсновнойВидТелефонаКонтакта.Получить();
		
		ЗаполнитьСписокВыбораВидаКИ(Элементы.CRM_ОсновнойВидEmailКлиента,
									Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
									Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
		ЗаполнитьСписокВыбораВидаКИ(Элементы.CRM_ОсновнойВидТелефонаКлиента,
									Перечисления.ТипыКонтактнойИнформации.Телефон,
									Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
		ЗаполнитьСписокВыбораВидаКИ(Элементы.CRM_ОсновнойВидEmailКонтакта,
									Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
									Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров);
		ЗаполнитьСписокВыбораВидаКИ(Элементы.CRM_ОсновнойВидТелефонаКонтакта,
									Перечисления.ТипыКонтактнойИнформации.Телефон,
									Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров);
									
	Иначе
		Элементы.ГруппаОбщиеНастройки.Видимость = Ложь;
	КонецЕсли;
	
	ИспользоватьТипыУслуг = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьТипыУслуг");
	ЗаполнитьДоступныеСценарииПродаж();
	
	ЗаполнитьВариантыНазначенияОтветственного();
	
	ИзмененСоставРеквизитов = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОсновнойТипОбращенияПриИзменении(Элемент)
	
	ЗаполнитьДоступныеСценарииПродаж();
	
КонецПроцедуры // ОсновнойТипОбращенияПриИзменении()

&НаКлиенте
Процедура ОсновнойТипУслугПриИзменении(Элемент)
	
	ЗаполнитьДоступныеСценарииПродаж();
	
КонецПроцедуры // ОсновнойТипУслугПриИзменении()

&НаКлиенте
Процедура ПубличныеДоменыДекорацияНажатие(Элемент)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПубличныеДоменыНажатиеЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CRM_ФормаСпискаПубличныхДоменов",,
		ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПубличныеДоменыНажатиеЗавершение(Результат, ДопПараметры) Экспорт
	Возврат; // Заглушка
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьСВозвратомПараметров()
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ОсновнойТипУслуги", ОсновнойТипУслуг);
	СтруктураВозврата.Вставить("ОсновнойТипОбращения", ОсновнойТипОбращения);
	СтруктураВозврата.Вставить("ИзмененСоставРеквизитов", ИзмененСоставРеквизитов);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЗакрытьСВозвратомПараметров();
КонецПроцедуры

&НаСервере
Процедура ПрименитьНаСервере()
	
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойТипУслуг;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Значение = ОсновнойТипУслуг;
	Менеджер.Пользователь = Пользователи.АвторизованныйПользователь();
	Менеджер.Записать(Истина);
	
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойСценарий;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Значение = ОсновнойСценарий;
	Менеджер.Пользователь = Пользователи.АвторизованныйПользователь();
	Менеджер.Записать(Истина);
	
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойТипОбращения;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Значение = ОсновнойТипОбращения;
	Менеджер.Пользователь = Пользователи.АвторизованныйПользователь();
	Менеджер.Записать(Истина);
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.РежимВводаНовогоКлиента",
		 "МастерРегистрации",
		 РежимВводаНовогоКлиента);
		 
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.НазначениеОтветственного",
		 "МастерРегистрации",
		 ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаНазначенияОтветственного.Выгрузить()));
		 
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.ПоискПоПочтовомуДомену",
		 "МастерРегистрации",
		 ПоискПоПочтовомуДомену);
	
	Если РольДоступна("ПолныеПрава") Или РольДоступна("CRM_НастройкаПрограммы") Тогда
		Если CRM_ОсновнойВидEmailКлиента <> Константы.CRM_ОсновнойВидEmailКлиента.Получить() Тогда
			Константы.CRM_ОсновнойВидEmailКлиента.Установить(CRM_ОсновнойВидEmailКлиента);
		КонецЕсли;
		Если CRM_ОсновнойВидТелефонаКлиента <> Константы.CRM_ОсновнойВидТелефонаКлиента.Получить() Тогда
			Константы.CRM_ОсновнойВидТелефонаКлиента.Установить(CRM_ОсновнойВидТелефонаКлиента);
		КонецЕсли;
		Если CRM_ОсновнойВидEmailКонтакта <> Константы.CRM_ОсновнойВидEmailКонтакта.Получить() Тогда
			Константы.CRM_ОсновнойВидEmailКонтакта.Установить(CRM_ОсновнойВидEmailКонтакта);
		КонецЕсли;
		Если CRM_ОсновнойВидТелефонаКонтакта <> Константы.CRM_ОсновнойВидТелефонаКонтакта.Получить() Тогда
			Константы.CRM_ОсновнойВидТелефонаКонтакта.Установить(CRM_ОсновнойВидТелефонаКонтакта);
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	ПрименитьНаСервере();
	ЗакрытьСВозвратомПараметров();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСоставРеквизитов(Команда)
	Оповещение = Новый ОписаниеОповещения("НастроитьСоставРеквизитовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНастройкиСоставаРеквизитов", ,
		 ЭтотОбъект, , , , Оповещение,
		 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСписокВыбораВидаКИ(Элемент, ТипКИ, РодительКИ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Родитель = &РодительКИ
		|	И ВидыКонтактнойИнформации.Тип = &ТипКИ";
	
	Запрос.УстановитьПараметр("ТипКИ", ТипКИ);
	Запрос.УстановитьПараметр("РодительКИ", РодительКИ);
	
	РезультатЗапросаТЗ = Запрос.Выполнить().Выгрузить();
	
	Элемент.РежимВыбораИзСписка = Истина;
	Элемент.КнопкаСоздания = Ложь;
	Элемент.СписокВыбора.ЗагрузитьЗначения(РезультатЗапросаТЗ.ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСоставРеквизитовЗавершение(Результат, ДопРеквизиты) Экспорт
	Если Результат = Истина Тогда
		ИзмененСоставРеквизитов = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеСценарииПродаж()
	
	ЭтоПоддержка = (ЗначениеЗаполнено(ОсновнойТипОбращения)
		 И ОсновнойТипОбращения <> Справочники.CRM_ТипыОбращений.Интерес);
	
	ПараметрыСценариев = Новый Структура;
	ПараметрыСценариев.Вставить("ТипУслуги",				ОсновнойТипУслуг);
	ПараметрыСценариев.Вставить("ТипОбращения",				ОсновнойТипОбращения);
	ПараметрыСценариев.Вставить("ЭтоПоддержка",				ЭтоПоддержка);
	ПараметрыСценариев.Вставить("Ответственный",			Пользователи.АвторизованныйПользователь());
	ПараметрыСценариев.Вставить("ИспользоватьТипыУслуг",	ИспользоватьТипыУслуг);
	ПараметрыСценариев.Вставить("ДоступныКарты",			Ложь);
	
	ДоступныеСценарии = Обработки.CRM_МастерРегистрацииОбращения.ПолучитьДоступныеСценарииПродаж(ПараметрыСценариев);
	
	Элементы.ОсновнойСценарий.СписокВыбора.Очистить();
	
	СписокСодержитТекущийОсновнойСценарийИзНастройки = Ложь;
	Для Каждого ТекущийСценарийОбхода Из ДоступныеСценарии Цикл
		Элементы.ОсновнойСценарий.СписокВыбора.Добавить(ТекущийСценарийОбхода.Значение.Ссылка);
		
		Если ОсновнойСценарий = ТекущийСценарийОбхода.Значение.Ссылка Тогда
			СписокСодержитТекущийОсновнойСценарийИзНастройки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не СписокСодержитТекущийОсновнойСценарийИзНастройки
			И ЗначениеЗаполнено(ОсновнойСценарий)
			И (ЗначениеЗаполнено(ОсновнойТипУслуг) Или ЗначениеЗаполнено(ОсновнойТипОбращения)) Тогда
		ОсновнойСценарий = Справочники.CRM_СостоянияИнтересов.ПустаяСсылка();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("en = 'The ""Main sales scenario"" setting was cleared due to a change in the dependent setting: ""Main type of services"" or ""Main type of treatment""';
				| ru = 'Настройка ""Основной сценарий продажи"" была очищена по причине изменения зависимой настройки: ""Основной тип услуг"" или ""Основной тип обращения""'")
		);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьДоступныеСценарииПродаж()

&НаСервере
Процедура ЗаполнитьВариантыНазначенияОтветственного()
	
	ТаблицаИсточник = Обработки.CRM_МастерРегистрацииОбращения.ВариантыНазначенияОтветственного();
	
	ТаблицаНазначенияОтветственного.Очистить();
	Для Каждого СтрИсточник Из ТаблицаИсточник Цикл
		
		НС = ТаблицаНазначенияОтветственного.Добавить();
		ЗаполнитьЗначенияСвойств(НС, СтрИсточник);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
